{
  "welcome": {
    "title": "Introduction & Pre-Test",
    "participantSees": "Participant is at the welcome screen.",
    "hasTimer": false,
    "script": "\"Hi, I'm going to be administering your challenge today as part of your participation in the BETA Pilot Study. The purpose of this test is to better understand the association between stress and blood glucose levels.\\n\\nBefore we begin, I'd like to confirm a few things. Firstly, could you please ensure that your video window is expanded to full screen? Can you hear and see me well?\\n\\nThis challenge should take about 30 minutes and thereafter you'll be expected to consume the (e.g., [see challenge tracker for type of beverage]) beverage provided to you and will have to refrain from exercise activities for 90 minutes. Ideally, you stay seated for this time. Do you still have adequate time this morning to complete this full procedure?\\n\\nDo you have the provided beverage nearby, ready to consume?\\n\\nYou are expected to fast for 8 hours prior to this challenge, and reduce stress-inducing activities prior to. Were you able to fast? Is there anything you did this morning that you want to mention that involved strenuous exercise, or a stressful exposure?\\n\\nCould you please make sure you have your smartphone nearby and open up the MyT1Diabetes app. Please put your phone on silent for the duration of this procedure, and avoid looking at or checking your phone unless instructed by me.\\n\\nLastly, could you confirm that you are wearing all of your study devices. This includes the Empatica EmbracePlus, the Oura ring, and the CGM. Are the devices all charged and working?\"",
    "actions": ["Confirm participant can see and hear you.", "Confirm they have adequate time and the beverage nearby.", "Confirm fasting, activity, and device status.", "Document how well the participant was able to follow the pre-challenge instructions and any deviations (e.g., if they didn't fast, what did they consume and when?)."]
  },
  "preBaselineSurvey": {
    "title": "Stress Baseline Survey",
    "participantSees": "Participant is being asked to log their stress level in the MyT1Diabetes app.",
    "hasTimer": false,
    "script": "\"Next I'm going to ask you to rate your current stress levels using the scale provided on the screen. Please log your response by opening your study app and adding your response to the I've Noticed.. feature labelling your entry as Stress 0= [answer].\\n\\nNow we're going to begin.\\n\\nI'm going to start recording the call now so that your performance on the upcoming tasks can be later scored by additional evaluators.\"",
    "actions": ["<strong>Start recording the call.</strong>"]
  },
  "baseline": {
    "title": "Resting Baseline",
    "participantSees": "Participant sees a 3-minute timer and instructions to relax.",
    "hasTimer": true,
    "timerDefault": "3:00",
    "script": "\"For the next 3 minutes, please remain seated. Relax, and try to clear your mind, and remain still and quiet. You can leave your eyes open, or close them if you prefer. Please leave your camera on for the duration of this procedure. I'm going to step away, but we will still be monitoring you.\"",
    "actions": ["Turn off your video, but continue to monitor participant.", "When timer ends, turn camera back on and say: \"We’ll now move to the next phase. I’m going to start to record the call as we move into the performance section of this challenge, so that your performance can be later evaluated by an additional jury.\""]
  },
  "speechPreparation": {
    "title": "Speech Preparation",
    "participantSees": "Participant sees a 5-minute timer and instructions to prepare a speech.",
    "hasTimer": true,
    "timerDefault": "5:00",
    "script": "\"We're going to be assessing how well you perform in situations where you must project yourself as an expert. This is a type of personality test. I'd like you to use the imaginary situation where you will be applying for your dream job. Please imagine this ideal job. You will have 5 minutes to prepare a persuasive speech to convince me and an additional jury that you are the best candidate for this dream job as if you were applying for this job and were invited for an interview. After that you will have 5 minutes to give the speech. Please think silently, and refrain from taking any notes or writing anything down (and I'll be checking in on that). Your speech will be recorded for later evaluation by additional trained raters and there may be some follow-up questions once you complete your speech if time allows. Once I turn off my camera and start the 5 minute timer, your preparation will begin. The timer on the screen will let you know how much time you have left.\"",
    "actions": ["Turn off your video camera.", "Start the timer.", "When timer ends, turn camera back on and say: \"Please remain seated; we'll begin your speech in just a moment.\""]
  },
  "speechDelivery": {
    "title": "Speech Delivery",
    "participantSees": "Participant sees a 5-minute timer and instructions to deliver their speech.",
    "hasTimer": true,
    "timerDefault": "5:00",
    "script": "\"Please begin your 5-minute speech. Remember, no notes. I will start the timer now.\"",
    "actions": ["Start the timer.", "Observe participant, maintaining a neutral, unresponsive demeanor.", "If participant stops early, use questions from Appendix A below.", "When timer ends, state: <strong>\"your time is up, please stop your speech\".</strong>"],
    "context": "If the participant begins to ask questions about their speech, reiterate that they are explaining why they are the best candidate for the job, and 'do what they think is best', or 'say whatever comes to your mind'. Continue to redirect the participant to begin this speech.",
    "appendix": {
      "title": "Follow-up Questions (Appendix A)",
      "content": "\"Give me the most significant mistake you’ve made in your career. What exactly did you do wrong, and how did it affect your results?\"\\n\\n\"Describe a situation where a supervisor criticized your work. What was the criticism, and why should we trust that you’ve truly fixed the issue?\"\\n\\n\"Convince me that hiring you won’t be a risk to our organization’s reputation.\"\\n\\n\"Explain the biggest gap or setback in your career and why it shouldn’t count against you compared with other applicants.\"\\n\\n\"Tell me about a time you let a client or stakeholder down. What did you do to recover, and why shouldn’t we worry that it could happen here?\"\\n\\n\"Which core competency for this role is currently your weakest, and what concrete evidence shows you can overcome that weakness under pressure?\"\\n\\n\"If we surveyed your last team today, what would be the harshest piece of feedback they’d give about your leadership style?\"\\n\\n\"Assume you’re not selected for this position. What personal failing would most likely have caused that outcome?\""
    }
  },
  "mentalArithmetic": {
    "title": "Mental Arithmetic",
    "participantSees": "Participant sees a 5-minute timer and instructions for the math task.",
    "hasTimer": true,
    "timerDefault": "5:00",
    "script": "\"We will now begin a mental math challenge. Starting from the number 2,023, I'd like you to subtract 17 repeatedly, speaking each result aloud as quickly and accurately as possible. For example, if you were starting from 10 and subtracting by 2, you would say: '10, 8, 6, 4,' and so on. If you make an error, you will be instructed to return to 2,023 and start again. You have five minutes. Okay, now begin subtracting 17 repeatedly from 2,023.\"",
    "actions": ["Start the timer.", "Track answers using the answer sheet below.", "If a participant provides an incorrect answer, state: <strong>\"That is incorrect. Please start over at 2,023\"</strong> when needed."],
    "appendix": {
      "title": "Answer Key (Appendix B)",
      "content": "2023, 2006, 1989, 1972, 1955, 1938, 1921, 1904, 1887, 1870, 1853, 1836, 1819, 1802, 1785, 1768, 1751, 1734, 1717, 1700, 1683, 1666, 1649, 1632, 1615, 1598, 1581, 1564, 1547, 1530, 1513, 1496, 1479, 1462, 1445, 1428, 1411, 1394, 1377, 1360, 1343, 1326, 1309, 1292, 1275, 1258, 1241, 1224, 1207, 1190, 1173, 1156, 1139, 1122, 1105, 1088, 1071, 1054, 1037, 1020, 1003, 986, 969, 952, 935, 918, 901, 884, 867, 850, 833, 816, 799, 782, 765, 748, 731, 714, 697, 680, 663, 646, 629, 612, 595, 578, 561, 544, 527, 510, 493, 476, 459, 442, 425, 408, 391, 374, 357, 340, 323, 306, 289, 272, 255, 238, 221, 204, 187, 170, 153, 136, 119, 102, 85, 68, 51, 34, 17, 0"
    }
  },
  "postTaskSurvey": {
    "title": "Post-Task Stress Survey",
    "participantSees": "Participant is being asked to log their stress level again.",
    "hasTimer": false,
    "script": "\"That concludes the performance tasks.\\n\\nI'm going to ask you to again rate your current level of stress using the I've noticed.. feature in the study app using the label Stress 1= [Answer].\"",
    "actions": ["Wait for the participant to confirm they have logged their stress level."]
  },
  "meal": {
    "title": "Post-Task Meal",
    "participantSees": "Participant sees a 5-minute timer and instructions to consume the beverage.",
    "hasTimer": true,
    "timerDefault": "5:00",
    "script": "\"When you have completed adding your entry into the I've noticed feature, please consume the provided liquid meal within five minutes. I will wait until you're finished. Please leave your camera on\"",
    "actions": ["Start the 5-minute meal timer.", "Observe participant during consuming meal until timer reaches 00:00."],
    "context": "The participant needs to drink the entire beverage within 5 minutes. You can explain or express the significance of this if they are taking longer than usual. Drinks should also not be consumed in too short a time. Aim for approximately 5 minutes across all participants."
  },
  "complete": {
    "title": "Debrief & Close",
    "participantSees": "Participant sees the 'Challenge Complete' screen.",
    "hasTimer": false,
    "script": "\"Thank you for completing today's tasks. For the next 2 hours, until approximately __END_TIME__, please stay seated as much as possible and avoid food, beverages, and strenuous or stressful activity. After that 2-hour period, you may resume your normal routine. If your blood sugar falls out of range, either below 70 mg/dL or above 250 mg/dL, please treat as needed and contact the study coordinator. Do you have any questions before we end?\"",
    "actions": ["Stop recording, end video call.", "If Final Challenge: Complete a debrief (Appendix C)."]
  }
}
